# Смена директории

In [1]:
%cd ..

/Users/uzumnasiya/Work/RM_UTILS

# Импорт библиотек

In [2]:
import pandas as pd
from rm_utils.reports.reporter import ExcelReporter

In [3]:
path = r'examples/data/report.xlsx'
writer = ExcelReporter(path)

['Sheet']

In [8]:
data = pd.DataFrame(
    {
        "Name": ["John", "Alice", "Bob"],
        "Age": [25, 30, 35],
        "City": ["New York", "London", "Paris"],
    }
)

data

    Name  Age      City
0   John   25  New York
1  Alice   30    London
2    Bob   35     Paris

In [9]:
writer.add_dataframe(data, row_offset=5, col_offset=2)

In [10]:
writer.save()